app/controllers/admin/access_controller.rb

INSERT INTO "preferences" ("allow_create_songs", "allow_create_artists", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["allow_create_songs", "t"], ["allow_create_artists", "t"], ["created_at", "2016-02-07 13:38:43.875492"], ["updated_at", "2016-02-07 13:38:43.875492"]]
SELECT  "preferences".* FROM "preferences"  ORDER BY "preferences"."id" ASC LIMIT 1
---
  def index
    @preference = Preference.first_or_create(allow_create_songs: true, allow_create_artists: true)

UPDATE "preferences" SET "allow_create_songs" = ?, "allow_create_artists" = ?, "updated_at" = ? WHERE "preferences"."id" = ?  [["allow_create_songs", "f"], ["allow_create_artists", "t"], ["updated_at", "2016-02-02 00:17:49.602109"], ["id", 1]]
---
  def update
    @preference = Preference.update(params[:preference][:id], access_params)